# Groupby

In [46]:
import numpy as np
import seaborn as sns

In [47]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG', 'GOOG',
                   'MSFT','MSFT', 'MSFT',
                   'FB','FB', 'FB'
                  ],
       'Person':['Sam','Charlie','Amy',
                 'Vanessa','Carl', 'Bob',
                 'Sarah', 'Ann', 'John'],
       'Sales':[200,120,340,
                420, 124,243,
                350,230, 333]}

In [48]:
df = pd.DataFrame(data)

In [49]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG      Amy    340
3    MSFT  Vanessa    420
4    MSFT     Carl    124
5    MSFT      Bob    243
6      FB    Sarah    350
7      FB      Ann    230
8      FB     John    333

In [50]:
df.groupby('Company')

In [51]:
by_comp = df.groupby(["Company"])

In [ ]:
by_comp['Sales'].mean()

In [53]:
df.groupby("Company")['Sales'].mean()

Company
FB      304.333333
GOOG    220.000000
MSFT    262.333333
Name: Sales, dtype: float64

In [56]:
df.groupby("Company")[['Sales']].mean().reset_index()

  Company       Sales
0      FB  304.333333
1    GOOG  220.000000
2    MSFT  262.333333

In [65]:
def skewness(arr: np.ndarray) -> float:
    return ((arr - arr.mean()) ** 3).sum() / arr.std() ** 3

df.gropuby([niz kolona]).agg(ime_agregacije = (kolona koja se agregira, 
operacija agregacije))

In [66]:
df_stats = df.groupby(['Company']).agg(mean_sales = ('Sales', 'mean'),
                          std_sales = ('Sales', 'std'),
                          swennes_sales = ('Sales', skewness),
                          n_records = ('Person', 'count'),
                          n_person = ('Person', 'nunique')
                         )

In [67]:
df_stats

         mean_sales   std_sales  swennes_sales  n_records  n_person
Company
FB       304.333333   64.933299      -1.066299          3         3
GOOG     220.000000  111.355287       0.521435          3         3
MSFT     262.333333  148.944061       0.382847          3         3

In [68]:
df_stats[df_stats['n_records'] != df_stats['n_person']]

Empty DataFrame
Columns: [mean_sales, std_sales, swennes_sales, n_records, n_person]
Index: []

In [69]:
df['w_s'] = 0.8 * df['Sales']

In [76]:
def weighing_sales(sales: float, w: float = 0.8, p=0.2) -> float:
    return w * sales

In [77]:
df['Sales'].apply(weighing_sales, w=0.5, p=0.3)

0    100.0
1     60.0
2    170.0
3    210.0
4     62.0
5    121.5
6    175.0
7    115.0
8    166.5
Name: Sales, dtype: float64

In [80]:
df[['Sales', 'w_s']].apply(np.mean, axis=1)

0    180.0
1    108.0
2    306.0
3    378.0
4    111.6
5    218.7
6    315.0
7    207.0
8    299.7
dtype: float64

In [83]:
df['nova_kolona'] = df.apply(lambda row: 0.5 * (row['Sales'] + row['w_s']), axis=1)
df

  Company   Person  Sales    w_s  nova_kolona
0    GOOG      Sam    200  160.0        180.0
1    GOOG  Charlie    120   96.0        108.0
2    GOOG      Amy    340  272.0        306.0
3    MSFT  Vanessa    420  336.0        378.0
4    MSFT     Carl    124   99.2        111.6
5    MSFT      Bob    243  194.4        218.7
6      FB    Sarah    350  280.0        315.0
7      FB      Ann    230  184.0        207.0
8      FB     John    333  266.4        299.7

In [86]:
df.loc[0, 'Sales'] = np.nan

In [90]:
df['nova_kolona'] = df.apply(lambda row: 0.5 * (row['Sales'] + row['w_s']), axis=1)
df

  Company   Person  Sales    w_s  nova_kolona
0    GOOG      Sam    NaN  160.0          NaN
1    GOOG  Charlie  120.0   96.0        108.0
2    GOOG      Amy  340.0  272.0        306.0
3    MSFT  Vanessa  420.0  336.0        378.0
4    MSFT     Carl  124.0   99.2        111.6
5    MSFT      Bob  243.0  194.4        218.7
6      FB    Sarah  350.0  280.0        315.0
7      FB      Ann  230.0  184.0        207.0
8      FB     John  333.0  266.4        299.7